sdaiPrevious(Sdai_ItrId*)
\details
Moves current iterator to the previous aggregate item.
\param iterator [in] iterator to move.
\returns Returns sdaiTRUE if there is a member at the new current position;
sdaiFALSE if there is no member at the new current position.